import pandas as pd

df = pd.DataFrame({'Скорость ветра, м/с': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
                   'К4': [1, 1.33, 1.67, 2.0, 2.34, 2.67, 3.0, 3.34, 3.67, 4.0, 4.34, 4.67, 5.01, 5.34, 5.68],
                   'Угл. размеры возможной зоны заражения': [90, 90, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45,
                                                             45, 45, 45],
                   'Инверсия (скорость переднего фронта)':[5, 10, 16, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                   'Изотермия (скорость переднего фронта)':[6, 12, 18, 24, 29, 35, 41, 47, 53, 59, 65, 71,
                                                            76, 82, 88],
                   'Конвекция (скорость переднего фронта)':[7, 14, 21, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]})

df.to_excel('./coefficients2.xlsx')
